-- Вставляем тестовые данные в таблицу hospitals
INSERT INTO hospitals (name, address, contact_phone, is_deleted)
VALUES ('Центральная больница', 'г. Москва, ул. Ленина, 1', '1234567890', FALSE),
       ('Городская клиника', 'г. Санкт-Петербург, ул. Пушкина, 10', '0987654321', FALSE),
       ('Областная больница', 'г. Казань, пр. Победы, 20', '1122334455', FALSE);

-- Вставляем тестовые данные в таблицу hospital_rooms
INSERT INTO hospital_rooms (name, hospital_id)
VALUES ('Комната 101', 1),
       ('Комната 102', 1),
       ('Комната 201', 2),
       ('Комната 202', 2),
       ('Комната 301', 3),
       ('Комната 302', 3);

-- Вставляем тестовые данные в таблицу timetables
INSERT INTO timetables ("from", "to", doctor_id, hospital_id, room_id)
VALUES ('2024-10-01 09:00:00', '2024-10-01 12:00:00', 2, 1, 1),
       ('2024-10-01 13:00:00', '2024-10-01 15:00:00', 2, 1, 2),
       ('2024-10-02 09:00:00', '2024-10-02 12:00:00', 2, 2, 3),
       ('2024-10-02 13:00:00', '2024-10-02 15:00:00', 3, 3, 5),
       ('2024-10-03 10:00:00', '2024-10-03 11:00:00', 3, 1, 2),
       ('2024-10-03 12:00:00', '2024-10-03 13:00:00', 1, 3, 6);